import { xianRequest } from '../../utils/xianRequest'
import { HOST } from '../config'
/**
 * 规范标准
 * 每个模块的使用 example:
 *                    ####首页#####
 *                    ####购物车###
 */

// 本地调试api地址
// ####################测试示例#########################
// api示例
const getTestData = (params = {}) => {
  // console.log('1')
  return xianRequest(params, `${HOST}/getIp`)
}
// ####################首页#############################

// ####################购物车###########################

// ##################地址##############################

// ####################鲜卡#########################

// ####################订单#########################

module.exports = {
  getTestData
}
